import React from "react";
import "./Eula.css";

const Eula = ({ close }) => {
  const closePopup = () => {
    close(false);
  };

  return (
    <div className="eula-card">
      <span onClick={closePopup} className="esc close-eula">
        X
      </span>
      <h2>תקנון שימוש – CREAITOR</h2>
      <p>שימוש באפליקציה: האפליקציה מאפשרת להסיר ולשנות רקע לתמונות. השימוש אישי בלבד.</p>

      <p>זכויות על תמונות: המשתמש מאשר כי יש לו זכויות על כל תמונה שהוא מעלה, והוא אחראי בלעדית עליה.</p>

      <p>פרטיות: התמונות מעובדות לשם השירות בלבד ולא נשמרות לצרכים אחרים.</p>

      <p>אחריות: האפליקציה ניתנת כמות שהיא ("As Is"). מפעילי האפליקציה לא אחראים לכל נזק שייגרם משימוש בה.</p>

      <p>שימוש אסור: חל איסור להעלות תכנים בלתי חוקיים או פוגעניים.</p>

      <p>עדכוני  ם: ייתכנו שינויים בתקנון מעת לעת. שימוש מתמשך מהווה הסכמה לעדכונים.</p>
    </div>
  );
};

export default Eula;
